In [1]:
import numpy as np
import pandas as pd

DataFrame - двумерная структура данных библиотеки Pandas

In [4]:
df = pd.DataFrame({'Col1':['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], 'Col2': [1, 3, 4, 5, 6, 7, 8, 9]}, columns=['Col1', 'Col2'])
df

  Col1  Col2
0    a     1
1    b     3
2    c     4
3    d     5
4    e     6
5    f     7
6    g     8
7    h     9

In [5]:
df.shape

(8, 2)

In [6]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    8 non-null      object
 1   Col2    8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [9]:
df.describe()

          Col2
count  8.00000
mean   5.37500
std    2.66927
min    1.00000
25%    3.75000
50%    5.50000
75%    7.25000
max    9.00000

In [11]:
df.head()

  Col1  Col2
0    a     1
1    b     3
2    c     4
3    d     5
4    e     6

In [12]:
df.head(4)

  Col1  Col2
0    a     1
1    b     3
2    c     4
3    d     5

In [13]:
df['Col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [14]:
df.Col1.head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [15]:
df.tail()

  Col1  Col2
3    d     5
4    e     6
5    f     7
6    g     8
7    h     9

#### Изменение индекса

In [16]:
df.index = [2, 4, 6, 8, 10, 12, 14, 16]
df

   Col1  Col2
2     a     1
4     b     3
6     c     4
8     d     5
10    e     6
12    f     7
14    g     8
16    h     9

#### Выбор данных по индексу

In [18]:
df.loc[2, 'Col1']

'a'

In [19]:
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [20]:
df.loc[2:4, :]

  Col1  Col2
2    a     1
4    b     3

#### Выбор данных по позиции

In [21]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     4
8     d     5
10    e     6
12    f     7
14    g     8
16    h     9

In [22]:
df.iloc[0, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [23]:
df.iloc[0:2, :]

  Col1  Col2
2    a     1
4    b     3

In [24]:
df.iloc[0:2, 0]

2    a
4    b
Name: Col1, dtype: object

#### Выбор по условию

In [26]:
df.loc[df['Col1'] == 'b', :]

  Col1  Col2
4    b     3

In [27]:
df.loc[df['Col1'] == 'b', 'Col2']

4    3
Name: Col2, dtype: int64

In [29]:
df.loc[df['Col1'] == 'b', 'Col2'].values

array([3])

In [31]:
df.loc[df['Col2'] > 6, 'Col1']

12    f
14    g
16    h
Name: Col1, dtype: object

In [36]:
df.loc[(df['Col2'] > 6) & (df['Col1'] != 'g'), :]

   Col1  Col2
12    f     7
16    h     9

In [38]:
df.loc[df['Col2'].between(5, 7), :]

   Col1  Col2
8     d     5
10    e     6
12    f     7

In [40]:
df.loc[df['Col1'].isin(['a', 'b', 'c', 'd']), :]

  Col1  Col2
2    a     1
4    b     3
6    c     4
8    d     5

In [41]:
df.loc[~df['Col1'].isin(['a', 'b', 'c', 'd']), :]

   Col1  Col2
10    e     6
12    f     7
14    g     8
16    h     9

### Метод query

In [42]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     4
8     d     5
10    e     6
12    f     7
14    g     8
16    h     9

In [43]:
df.query('Col1 == "b"')

  Col1  Col2
4    b     3

In [45]:
df.query('Col2 > 5')

   Col1  Col2
10    e     6
12    f     7
14    g     8
16    h     9

### Столбец DataFrame в виде Series

In [47]:
s = df['Col1']
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: Col1, dtype: object

In [48]:
type(s)

pandas.core.series.Series

### Получение DataFrame из Series

In [49]:
df2 = pd.DataFrame(s)
df2

   Col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

### Клонирование DataFrame

In [51]:
df_copy = df.copy()
df_copy

   Col1  Col2
2     a     1
4     b     3
6     c     4
8     d     5
10    e     6
12    f     7
14    g     8
16    h     9

### Случайный выбор n-го количества строк

In [56]:
df.sample(n = 2)

   Col1  Col2
16    h     9
8     d     5

### Случайный выбор доли от исходного датафрейма

In [61]:
df.sample(frac = 0.5)

   Col1  Col2
16    h     9
8     d     5
4     b     3
14    g     8

### Случайный выбор с возращением (строки могут повторяться)

In [71]:
df.sample(frac=0.5, replace=True)

   Col1  Col2
16    h     9
10    e     6
6     c     4
14    g     8

### Случайное перемешивание

In [83]:
df.sample(frac=1.0, random_state=34)

   Col1  Col2
8     d     5
2     a     1
10    e     6
12    f     7
16    h     9
14    g     8
6     c     4
4     b     3

### Работа с файлами

In [84]:
df.to_csv('Test.csv', sep=';', index=False)

In [87]:
df_new = pd.read_csv('Test.csv', sep=';')
df_new

  Col1  Col2
0    a     1
1    b     3
2    c     4
3    d     5
4    e     6
5    f     7
6    g     8
7    h     9

Также можно записывать и в другие форматы